{"name":"Photography Portfolio Website","elevator":"We empower photographers to sell their professional work directly to customers through a dedicated e-commerce platform. Our platform offers secure transactions, efficient management tools, and a visually appealing dark mode design, providing a seamless experience for both photographers and buyers.","project":null,"description":"E-commerce platform for photographers to sell professional pictures online.","budget":"unknown","revenue_model":"unknown","market_orientation":"unknown","personal":false,"current_prd":{"id":121,"product_id":249,"version_number":0,"is_editable":true,"elevator_pitch":"E-commerce platform for photographers to sell professional pictures online.","problem_statement":"Photographers lack a dedicated platform to sell their work directly to customers, facing challenges in reaching a wider audience and managing transactions efficiently.","solution":"An e-commerce platform enabling photographers to showcase and sell their work, providing secure transactions and efficient management tools.","key_features":[{"feature_name":"Payment Processing","feature_description":"Secure payment gateway integration for safe and reliable transactions."},{"feature_name":"User Management","feature_description":"User accounts with personalized dashboards for managing profiles, portfolios, and sales."},{"feature_name":"Image Display","feature_description":"High-resolution image display with zoom and detailed descriptions."},{"feature_name":"Search and Filtering","feature_description":"Advanced search and filtering options to find specific types of photography."},{"feature_name":"Shopping Cart","feature_description":"Shopping cart and checkout process for purchasing multiple images."},{"feature_name":"UI/UX Design","feature_description":"Dark mode and elegant materialistic design for enhanced user experience."}],"user_flows":[{"steps":["User navigates to the registration page","User fills in the registration form with their details","User submits the form","System validates the user's input","System creates a new user account","System sends a verification email to the user","User clicks on the verification link in the email","System verifies the user's email address","User is redirected to the login page"],"flow_name":"User Registration"},{"steps":["Photographer logs into their account","Photographer navigates to the upload page","Photographer selects the photo to upload","Photographer adds a title and description to the photo","Photographer sets the price for the photo","Photographer submits the photo","System validates the photo and its metadata","System stores the photo in the database","System updates the photographer's portfolio"],"flow_name":"Photo Upload"},{"steps":["Buyer navigates to the photo's page","Buyer adds the photo to their shopping cart","Buyer proceeds to checkout","Buyer enters their payment information","Buyer confirms the purchase","System processes the payment","System sends a confirmation email to the buyer","System grants the buyer a license to use the photo","System updates the photographer's sales record"],"flow_name":"Photo Purchase"},{"steps":["Admin user navigates to the admin login page","Admin user enters their credentials","System authenticates the admin user","System redirects the admin user to the admin dashboard"],"flow_name":"Admin Dashboard Access"},{"steps":["Admin user navigates to the user management section","Admin user searches for a specific user","Admin user views the user's details","Admin user can update the user's information or deactivate the user's account"],"flow_name":"User Management (Admin)"},{"steps":["Admin user navigates to the sales reporting section","Admin user selects a date range","System generates a sales report for the selected date range","Admin user views the sales report, including total sales, top-selling photos, and revenue per photographer"],"flow_name":"Sales Reporting (Admin)"},{"steps":["Buyer initiates a purchase","System redirects the buyer to the payment gateway","Buyer enters their payment information","Payment gateway processes the payment","Payment gateway notifies the system of the payment status","System updates the order status and sends confirmation emails"],"flow_name":"Payment Processing"},{"steps":["An error occurs in the system","System logs the error details, including timestamp, error message, and affected user","System sends an alert to the technical operations team"],"flow_name":"Error Logging"},{"steps":["Developer commits code changes to the repository","Continuous integration system builds and tests the code","Continuous deployment system deploys the code to the production environment","System monitors the deployment process and sends notifications"],"flow_name":"Deployment"},{"steps":["User visits the website","Analytics system tracks the user's activity, including page views, time on site, and bounce rate","Analytics system generates reports on website traffic and user behavior"],"flow_name":"Website Traffic Monitoring"}],"success_metrics":"Number of registered photographers, number of images sold, website traffic, customer satisfaction ratings, transaction volume.","competitors":"Etsy, Shutterstock, Getty Images, Adobe Stock","vision":"To become the leading online marketplace for professional photography, connecting photographers with customers worldwide.","target_audience":[{"name":"Professional Picture Buyers","pain_points":"Finding unique and professional photos quickly","demographics":"Professionals, photography enthusiasts, businesses","needs_and_goals":"High-quality images for commercial and personal use"}],"phasing":[{"features":["UI/UX Design","Image Display","Search and Filtering"],"rationale":"This phase focuses on showcasing the core visual elements and browsing capabilities of the platform. It's demo-able because it allows stakeholders to experience the dark mode design, high-resolution image display, and search functionality without requiring full e-commerce capabilities.","phase_name":"Demo 1"},{"features":["User Management","Shopping Cart"],"rationale":"This phase adds the fundamental user account and shopping cart functionalities, enabling basic e-commerce transactions. It's launch-able as it allows users to create accounts, browse images, add them to a cart, and proceed to checkout, setting the stage for payment processing.","phase_name":"MVP"},{"features":["Payment Processing"],"rationale":"This phase integrates secure payment processing, completing the core e-commerce functionality. It's launch-able because it enables real transactions, allowing photographers to sell their work and customers to purchase images securely.","phase_name":"Launch 1"}],"design_principles":"Elegance, Materialistic Design, Dark Mode","user_personas":[{"name":"Sarah","goals":"Find images for marketing campaigns","ageRole":"35, Marketing Manager","pain_points":"Limited budget, needs high-quality images","preferred_device":"Laptop"},{"name":"David","goals":"Find unique images for client projects","ageRole":"28, Freelance Designer","pain_points":"Needs variety, struggles with licensing","preferred_device":"Desktop"},{"name":"Emily","goals":"Purchase prints for personal collection","ageRole":"45, Photography Enthusiast","pain_points":"Wants limited edition prints, desires secure payment","preferred_device":"Tablet"}],"user_journeys":[{"steps":[{"actor":"User","description":"Navigates to the homepage."},{"actor":"System","description":"Displays featured images and categories."},{"actor":"User","description":"Uses the search bar to find 'business meeting' images."},{"actor":"System","description":"Displays search results."},{"actor":"User","description":"Selects an image and views its details."},{"actor":"System","description":"Shows image details, price, and licensing options."},{"actor":"User","description":"Adds the image to the shopping cart."},{"actor":"System","description":"Confirms the image is added to the cart."},{"actor":"User","description":"Proceeds to checkout."}],"context":"Sarah needs an image for a social media campaign.","trigger":"Social media campaign planning"}],"sitemap":"Home\n- Categories\n- Featured\n- About Us\n- Contact\n- Image Detail\n- Shopping Cart\n- Checkout\n- My Account\n- Order History","navigation_design":"Main navigation bar at the top: Home, Categories, About Us, Contact. Footer with links to legal information and social media. Prominent search bar.","description":"","schema":"erDiagram\n  User {\n    INT id\n    VARCHAR name\n    VARCHAR email\n    VARCHAR password\n    TIMESTAMP created_at\n  }\n  Photo {\n    INT id\n    INT user_id\n    VARCHAR title\n    TEXT description\n    VARCHAR image_url\n    FLOAT price\n    TIMESTAMP uploaded_at\n    INT license_id\n  }\n  Order {\n    INT id\n    INT user_id\n    FLOAT total_amount\n    TIMESTAMP created_at\n  }\n  OrderItem {\n    INT id\n    INT order_id\n    INT photo_id\n    INT quantity\n    FLOAT price\n  }\n  License {\n    INT id\n    VARCHAR name\n    TEXT description\n  }\n  Photo ||--o{ OrderItem : contains\n  Order ||--o{ OrderItem : includes\n  User ||--o{ Photo : uploads\n  User ||--o{ Order : places\n  Photo }o--|| License : applies_to\n","sample_data":[{"rows":[{"id":1,"name":"Alice Smith","email":"alice@example.com","password":"hashed_password_1","created_at":"2024-07-24T10:00:00Z"},{"id":2,"name":"Bob Johnson","email":"bob@example.com","password":"hashed_password_2","created_at":"2024-07-24T11:00:00Z"}],"table_name":"User"},{"rows":[{"id":101,"price":25,"title":"City at Night","user_id":1,"image_url":"https://example.com/image1.jpg","license_id":1,"description":"A vibrant cityscape at night.","uploaded_at":"2024-07-24T12:00:00Z"},{"id":102,"price":30,"title":"Mountain Range","user_id":2,"image_url":"https://example.com/image2.jpg","license_id":2,"description":"A majestic mountain range under a clear sky.","uploaded_at":"2024-07-24T13:00:00Z"}],"table_name":"Photo"},{"rows":[{"id":1001,"user_id":1,"created_at":"2024-07-24T14:00:00Z","total_amount":55},{"id":1002,"user_id":2,"created_at":"2024-07-24T15:00:00Z","total_amount":30}],"table_name":"Order"},{"rows":[{"id":10001,"price":25,"order_id":1001,"photo_id":101,"quantity":2},{"id":10002,"price":30,"order_id":1002,"photo_id":102,"quantity":1}],"table_name":"OrderItem"},{"rows":[{"id":1,"name":"Standard","description":"Standard license for personal and commercial use."},{"id":2,"name":"Extended","description":"Extended license for multiple commercial projects."}],"table_name":"License"}],"mermaid_erd_diagram":"erDiagram\n  User {\n    INT id\n    VARCHAR name\n    VARCHAR email\n    VARCHAR password\n    TIMESTAMP created_at\n  }\n  Photo {\n    INT id\n    INT user_id\n    VARCHAR title\n    TEXT description\n    VARCHAR image_url\n    FLOAT price\n    TIMESTAMP uploaded_at\n    INT license_id\n  }\n  Order {\n    INT id\n    INT user_id\n    FLOAT total_amount\n    TIMESTAMP created_at\n  }\n  OrderItem {\n    INT id\n    INT order_id\n    INT photo_id\n    INT quantity\n    FLOAT price\n  }\n  License {\n    INT id\n    VARCHAR name\n    TEXT description\n  }\n  Photo ||--o{ OrderItem : contains\n  Order ||--o{ OrderItem : includes\n  User ||--o{ Photo : uploads\n  User ||--o{ Order : places\n  Photo }o--|| License : applies_to\n","user_stories":[{"title":"Upload and Manage Photos","user_story":{"as_a":"photographer","i_want":"to upload and manage my photos with pricing and licensing options","so_that":"I can sell my work through the platform."},"acceptance_criteria":["Given I am a photographer, when I upload a photo, then I can set a price for it.","Given I am a photographer, when I upload a photo, then I can add a description and tags.","Given I am a photographer, when I upload a photo, then I can specify the license type (e.g., commercial, personal).","Given I am a photographer, when I upload a photo, then I can see a preview of how it will look on the website."]},{"title":"Browse and Purchase Photos","user_story":{"as_a":"customer","i_want":"to browse and purchase high-quality photography","so_that":"I can use them for my personal or commercial projects."},"acceptance_criteria":["Given I am a customer, when I browse the website, then I see photos displayed in a visually appealing dark mode design.","Given I am a customer, when I click on a photo, then I see a larger preview and details like description, price, and license.","Given I am a customer, when I add a photo to my cart, then I can proceed to checkout.","Given I am a customer, when I complete a purchase, then I receive a download link for the photo."]},{"title":"Discover and Explore Photos","user_story":{"as_a":"website visitor","i_want":"to discover and explore a wide range of professional photos","so_that":"I can find the perfect image for my needs."},"acceptance_criteria":["Given I am a website visitor, when I land on the homepage, then I see featured photos and categories.","Given I am a website visitor, when I use the search bar, then I can find photos based on keywords or tags.","Given I am a website visitor, when I view a photographer's profile, then I see their portfolio and bio.","Given I am a website visitor, when I create an account, then I can save my favorite photos and track my purchases."]},{"title":"Administer the Platform","user_story":{"as_a":"admin","i_want":"to administer the platform effectively","so_that":"I can ensure quality, manage users, and track performance."},"acceptance_criteria":["Given I am an admin, when I log in to the admin panel, then I can manage users, photos, and transactions.","Given I am an admin, when I review a photo upload, then I can approve or reject it based on quality and licensing.","Given I am an admin, when I view sales reports, then I can track revenue and identify popular photos.","Given I am an admin, when I manage user accounts, then I can ban or suspend users who violate the terms of service."]},{"title":"Ensure System Stability and Security","user_story":{"as_a":"system operator","i_want":"to ensure the platform's stability, security, and performance","so_that":"users have a reliable and safe experience."},"acceptance_criteria":["Given the system detects a payment failure, when a transaction fails, then the user is notified and the order is cancelled.","Given the system detects a high volume of traffic, when the server load increases, then the system automatically scales resources to maintain performance.","Given the system detects a security threat, when a potential vulnerability is identified, then an alert is sent to the security team.","Given the system needs maintenance, when a scheduled maintenance window occurs, then the website is put into maintenance mode with a clear message to users."]},{"title":"Data Storage and Relationships","user_story":{"as_a":"developer","i_want":"to define the data storage and relationships between entities","so_that":"the platform can efficiently manage and retrieve data."},"acceptance_criteria":["Given I am a photographer, when I register on the platform, then my information is stored in the Users table.","Given I am a photographer, when I upload a photo, then the photo details are stored in the Photos table.","Given I am a photographer, when I set a price for a photo, then the price is stored in the Photos table.","Given I am a customer, when I place an order, then the order details are stored in the Orders table.","Given I am a customer, when I purchase a license for a photo, then the license details are stored in the Licenses table."]},{"title":"Manage Photographer Portfolios","user_story":{"as_a":"photographer","i_want":"to have a portfolio to showcase my best work","so_that":"potential customers can easily view my style and offerings."},"acceptance_criteria":["Given I am a user, when I view a photographer's profile, then I see their portfolio of uploaded photos.","Given I am a photographer, when I upload a photo, then it is automatically added to my portfolio.","Given I am a photographer, when I delete a photo, then it is removed from my portfolio.","Given I am an admin, when I view a user's profile, then I can see their portfolio."]},{"title":"Implement Shopping Cart and Checkout","user_story":{"as_a":"customer","i_want":"to easily add photos to a shopping cart and complete the checkout process","so_that":"I can purchase multiple photos in a single transaction."},"acceptance_criteria":["Given I am a customer, when I add photos to my cart, then the total price is calculated correctly.","Given I am a customer, when I proceed to checkout, then I can choose from available payment methods.","Given I am a customer, when I complete the payment, then I receive an order confirmation.","Given I am a customer, when a payment fails, then I receive an error message and can retry."]},{"title":"Enhance Search and Filtering","user_story":{"as_a":"customer","i_want":"to easily find the photos I need using advanced search and filtering options","so_that":"I can quickly locate the perfect image for my project."},"acceptance_criteria":["Given I am a photographer, when I upload a photo, then I can specify keywords or tags.","Given I am a customer, when I use the search bar, then I can find photos based on keywords or tags.","Given I am a customer, when I browse categories, then I see relevant photos.","Given I am a customer, when I filter search results, then I can narrow down the photos based on specific criteria (e.g., price, license type)."]}],"project_manager_score":9,"designer_score":8,"architect_score":8,"product_manager_score":9,"story_point_table":[{"qa":"3.0","tasks":["Design the photo upload interface, including fields for description, tags, price, and license type.","Design the preview display for uploaded photos.","Implement the photo upload form with validation.","Implement the preview display functionality.","Implement the logic to handle pricing and license options.","Implement the API endpoint to handle photo uploads.","Implement the logic to store photo metadata (description, tags, price, license) in the database.","Implement file storage functionality.","Test the photo upload functionality, including validation and error handling.","Test the preview display.","Test the storage of photo metadata and files.","Configure storage for uploaded photos (e.g., S3)."],"design":"2.0","system":"1.0","backend":"4.0","frontend":"4.0","user_story_title":"Upload and Manage Photos"},{"qa":"3.0","tasks":["Design the photo display in dark mode.","Design the photo details page with a larger preview, description, price, and license information.","Design the shopping cart and checkout flow.","Implement the photo display in dark mode.","Implement the photo details page with dynamic content.","Implement the shopping cart functionality.","Implement the checkout flow.","Implement the API endpoint to retrieve photo details.","Implement the shopping cart and checkout logic.","Implement payment processing integration.","Test the photo display and details page.","Test the shopping cart and checkout flow.","Test the payment processing integration."],"design":"4.0","system":"0.0","backend":"5.0","frontend":"8.0","user_story_title":"Browse and Purchase Photos"},{"qa":"1.0","tasks":["Design the homepage with featured photos and categories.","Design the search bar and results page.","Design the photographer's profile page with their portfolio and bio.","Implement the homepage with dynamic content.","Implement the search functionality.","Implement the photographer's profile page.","Implement the API endpoint to retrieve featured photos and categories.","Implement the search functionality.","Implement the API endpoint to retrieve photographer's profile information and portfolio.","Test the homepage, search functionality, and photographer's profile page."],"design":"3.0","system":"0.0","backend":"4.0","frontend":"6.0","user_story_title":"Discover and Explore Photos"},{"qa":"3.0","tasks":["Design the admin panel interface.","Design the user, photo, and transaction management pages.","Design the sales reports page.","Implement the admin panel interface.","Implement the user, photo, and transaction management pages.","Implement the sales reports page.","Implement the admin panel authentication.","Implement the API endpoints to manage users, photos, and transactions.","Implement the logic to generate sales reports.","Test the admin panel functionality, including user authentication and management.","Test the photo and transaction management pages.","Test the sales reports page."],"design":"5.0","system":"0.0","backend":"7.0","frontend":"8.0","user_story_title":"Administer the Platform"},{"qa":"4.0","tasks":["Design error messages and notifications for payment failures and maintenance mode.","Implement the display of error messages and notifications.","Implement the logic to detect payment failures and notify the user.","Implement the logic to automatically scale resources based on server load.","Implement security monitoring and alerting.","Test the error handling and notification system.","Test the system's ability to handle high traffic and scale resources.","Test the security monitoring and alerting system.","Configure auto-scaling for the server infrastructure.","Set up security monitoring and alerting tools."],"design":"1.0","system":"2.0","backend":"5.0","frontend":"1.0","user_story_title":"Ensure System Stability and Security"},{"qa":"1.0","tasks":["Define the database schema for Users, Photos, Orders, and Licenses tables.","Implement the relationships between the tables.","Validate the database schema and relationships.","Set up the database server."],"design":"0.0","system":"1.0","backend":"3.0","frontend":"0.0","user_story_title":"Data Storage and Relationships"},{"qa":"1.0","tasks":["Design the portfolio display on the photographer's profile page.","Implement the portfolio display on the photographer's profile page.","Implement the logic to retrieve and display the photographer's portfolio.","Test the portfolio display."],"design":"1.0","system":"0.0","backend":"1.0","frontend":"1.0","user_story_title":"Manage Photographer Portfolios"},{"qa":"1.0","tasks":["Implement the shopping cart functionality.","Implement the checkout process.","Implement the logic to calculate the total price in the shopping cart.","Implement the payment processing integration.","Implement order confirmation and error handling.","Test the shopping cart and checkout process.","Test the payment processing integration."],"design":"0.0","system":"0.0","backend":"4.0","frontend":"4.0","user_story_title":"Implement Shopping Cart and Checkout"},{"qa":"1.0","tasks":["Design the search bar and filtering options.","Implement the search bar and filtering options.","Implement the search functionality with keywords and tags.","Implement the filtering logic.","Test the search and filtering functionality."],"design":"1.0","system":"0.0","backend":"3.0","frontend":"2.0","user_story_title":"Enhance Search and Filtering"}],"effort_by_role_summary":{"with_rhino":{"qa_engineer":"9.5","ui_ux_designer":"9.0","systems_engineer":"0.6","backend_developer":"12.6","frontend_developer":"13.6"},"without_rhino":{"qa_engineer":"9.5","ui_ux_designer":"9.0","systems_engineer":"2.0","backend_developer":"18.0","frontend_developer":"17.0"}},"total_days_without_rhino":"85.0","total_days_with_rhino":"58.4","time_estimated_without_rhino":{"qa_engineer":"1.05","ui_ux_designer":"1.0","systems_engineer":"0.2","backend_developer":"2.0","frontend_developer":"2.0"},"time_estimated_with_rhino":{"qa_engineer":"1.05","ui_ux_designer":"1.0","systems_engineer":"0.06","backend_developer":"1.4","frontend_developer":"1.7"},"estimate_generated":true,"industry_category":"E-commerce Photography","geographic_scope":"Global","tam_description":"Total Addressable Market for online photography sales.","tam_estimated_value_usd":"10000000000.0","tam_estimation_basis":"Total global market for photography, including stock photos, licensed images, and prints.","tam_source":"Industry reports and market analysis","sam_description":"Serviceable Available Market for professional photography e-commerce platforms.","sam_estimated_value_usd":"5000000000.0","sam_estimation_basis":"Total spending on stock photos and licensed images globally.","sam_source":"Industry reports and market analysis","som_description":"Serviceable Obtainable Market within the professional photography e-commerce market.","som_estimated_value_usd":"50000000.0","som_estimation_basis":"Estimated market share based on platform adoption and marketing efforts.","som_source":"Internal estimates based on market penetration","avg_revenue_per_user_per_year":"100.0","expected_market_penetration_percent":"0.01","time_horizon_years":3,"customer_type":"Photography Buyers","pricing_model_basis":"Per Image License","key_competitors":["Etsy","Shutterstock","Getty Images","Adobe Stock"],"industry_growth_rate_cagr_percent":"5.0","advantage_summary":"Dedicated platform for photographers to sell directly to customers, offering secure transactions and efficient management tools.","market_sizing_generated":true,"created_at":"2025-09-29T12:07:12.776Z","updated_at":"2025-11-19T22:46:55.682Z","edit_mode":false,"current_edit_id":0,"version_name":"base_version","ai_statuses":{"edit":0,"generation":0,"post_processing":{"phasing":0,"reflection":0,"market_sizing":0,"scoping_estimator":0}},"ai_errors":{"edit":"","generation":"","post_processing":{"phasing":"","reflection":"","market_sizing":"","scoping_estimator":""}},"progress":{"prd_generation":100.0,"ui_prototype":true,"rhino_modules":false,"deployed":false},"planning":{"stage":"user_personas","stage_status":"generating","user_personas":null,"user_stories":null,"rhino_modules":{"planned":["rhino_core","rhino_organizations"]},"data_model":{"planned":[{"model":"License","table":"licenses","columns":[{"name":"name","type":"string"},{"name":"description","type":"text"},{"name":"organization_id","type":"bigint"}],"rhino_owner":"organization","validations":["validates :name, presence: true, length: { maximum: 255 }, uniqueness: { scope: :organization_id }","validates :description, length: { maximum: 1000 }"],"associations":[{"name":"organization","type":"belongs_to"},{"name":"photos","type":"has_many"}],"model_content":"class License \u003c ApplicationRecord\n  belongs_to :organization\n  has_many :photos, dependent: :destroy\n\n  validates :name, presence: true, length: { maximum: 255 }, uniqueness: { scope: :organization_id }\n  validates :description, length: { maximum: 1000 }\n\n  rhino_owner :organization\n  rhino_references [:organization]\nend","migration_content":"class CreateLicenses \u003c ActiveRecord::Migration[7.2]\n  def change\n    create_table :licenses do |t|\n      t.string :name, null: false, limit: 255\n      t.text :description, limit: 1000\n      t.references :organization, null: false, foreign_key: true\n\n      t.timestamps\n    end\n    add_index :licenses, [:name, :organization_id], unique: true\n  end\nend","rails_model_generation_command_line":"rails generate model License name:string description:text organization:references"},{"model":"Photo","table":"photos","columns":[{"name":"title","type":"string"},{"name":"description","type":"text"},{"name":"price","type":"float"},{"name":"user_id","type":"bigint"},{"name":"license_id","type":"bigint"}],"rhino_owner":"user","validations":["validates :title, presence: true, length: { maximum: 255 }","validates :price, presence: true, numericality: { greater_than_or_equal_to: 0 }","validates :description, length: { maximum: 2000 }","validates :image, presence: true"],"associations":[{"name":"user","type":"belongs_to"},{"name":"license","type":"belongs_to"},{"name":"image","type":"has_one_attached"},{"name":"order_items","type":"has_many"}],"model_content":"class Photo \u003c ApplicationRecord\n  belongs_to :user\n  belongs_to :license\n  has_one_attached :image\n  has_many :order_items, dependent: :destroy\n\n  validates :title, presence: true, length: { maximum: 255 }\n  validates :price, presence: true, numericality: { greater_than_or_equal_to: 0 }\n  validates :description, length: { maximum: 2000 }\n  validates :image, presence: true\n\n  rhino_owner :user\n  rhino_references [:user, :license]\nend","migration_content":"class CreatePhotos \u003c ActiveRecord::Migration[7.2]\n  def change\n    create_table :photos do |t|\n      t.string :title, null: false, limit: 255\n      t.text :description, limit: 2000\n      t.float :price, null: false\n      t.references :user, null: false, foreign_key: true\n      t.references :license, null: false, foreign_key: true\n\n      t.timestamps\n    end\n  end\nend","rails_model_generation_command_line":"rails generate model Photo title:string description:text price:float user:references license:references"},{"model":"Order","table":"orders","columns":[{"name":"total_amount","type":"float"},{"name":"user_id","type":"bigint"}],"rhino_owner":"user","validations":["validates :total_amount, presence: true, numericality: { greater_than_or_equal_to: 0 }"],"associations":[{"name":"user","type":"belongs_to"},{"name":"order_items","type":"has_many"}],"model_content":"class Order \u003c ApplicationRecord\n  belongs_to :user\n  has_many :order_items, dependent: :destroy\n\n  validates :total_amount, presence: true, numericality: { greater_than_or_equal_to: 0 }\n\n  rhino_owner :user\n  rhino_references [:user]\nend","migration_content":"class CreateOrders \u003c ActiveRecord::Migration[7.2]\n  def change\n    create_table :orders do |t|\n      t.float :total_amount, null: false\n      t.references :user, null: false, foreign_key: true\n\n      t.timestamps\n    end\n  end\nend","rails_model_generation_command_line":"rails generate model Order total_amount:float user:references"},{"model":"OrderItem","table":"order_items","columns":[{"name":"quantity","type":"integer"},{"name":"price","type":"float"},{"name":"order_id","type":"bigint"},{"name":"photo_id","type":"bigint"}],"rhino_owner":"order","validations":["validates :quantity, presence: true, numericality: { only_integer: true, greater_than: 0 }","validates :price, presence: true, numericality: { greater_than_or_equal_to: 0 }"],"associations":[{"name":"order","type":"belongs_to"},{"name":"photo","type":"belongs_to"}],"model_content":"class OrderItem \u003c ApplicationRecord\n  belongs_to :order\n  belongs_to :photo\n\n  validates :quantity, presence: true, numericality: { only_integer: true, greater_than: 0 }\n  validates :price, presence: true, numericality: { greater_than_or_equal_to: 0 }\n\n  rhino_owner :order\n  rhino_references [:order, :photo]\nend","migration_content":"class CreateOrderItems \u003c ActiveRecord::Migration[7.2]\n  def change\n    create_table :order_items do |t|\n      t.integer :quantity, null: false\n      t.float :price, null: false\n      t.references :order, null: false, foreign_key: true\n      t.references :photo, null: false, foreign_key: true\n\n      t.timestamps\n    end\n  end\nend","rails_model_generation_command_line":"rails generate model OrderItem quantity:integer price:float order:references photo:references"},{"model":"User","provided_by":"rhino_project_core"},{"model":"Organization","provided_by":"rhino_project_organizations"},{"model":"Role","provided_by":"rhino_project_organizations"},{"model":"UsersRole","provided_by":"rhino_project_organizations"}]}}}}